In [1]:
import pandas as pd
import numpy as np

# CSV/Excel/HTML/SQL 
## Libs : sqlalchemy, lxml, html5lib, BeautifulSoup4

In [3]:
pwd

'/home/follia/Documents/Coding/Python/Python_for_DataScience_and_MachineLearning/Pandas_DataAnalysis'

In [5]:
ls

example                  Pandas_Groupby.ipynb
Excel_Sample.xlsx        Pandas_merging_and_concatenating.ipynb
multi_index_example      Pandas_missingData.ipynb
Pandas_DataFrames.ipynb  Pandas_operations.ipynb
Pandas_data_IO.ipynb     Pandas_Series.ipynb

In [6]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
df = pd.read_csv('example')

In [8]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [9]:
df.to_csv('example_csv.csv', index = False)

In [10]:
df_csv = pd.read_csv('example_csv.csv')

In [11]:
df_csv

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [14]:
pd.read_excel('Excel_Sample.xlsx', sheet_name = 'Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [15]:
df.to_excel('Excel_Sample.xlsx', sheet_name = 'Sheet2')

In [16]:
data = pd.read_html("https://www.fdic.gov/bank/individual/failed/banklist.html")

In [17]:
type(data)

list

In [21]:
data[0].head(10)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 21, 2018"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","December 5, 2017"
5,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,"March 3, 2017","March 7, 2018"
6,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,"January 27, 2017","May 18, 2017"
7,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,"January 13, 2017","May 18, 2017"
8,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","September 25, 2017"
9,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","December 13, 2018"

In [22]:
from sqlalchemy import create_engine

In [23]:
engine = create_engine('sqlite:///:memory:')

In [29]:
df.to_sql('table', engine, index = False)

In [30]:
df_sql = pd.read_sql('table', con = engine)

In [31]:
df_sql

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15